micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal.c
    if(HAL_BSEC_OTP_Read(&sBsecHandler, BSEC_FUSE_ADDRESS, &data) != HAL_OK){
      data = 0xFFFFFFFFU;
    }
  }
  return data;
#else
  return 0xFFFFFFFFU;
#endif /* HAL_BSEC_MODULE_ENABLED */
}
#endif /* CPU_IN_SECURE_STATE */

/**
  * @brief  Return the first word of the unique device identifier (UID based on 96 bits)
  * @note   The application must ensures that SYSCFG clock is enabled.
  * @retval Device identifier
  */
uint32_t HAL_GetUIDw0(void)
{
  return (READ_REG(*((uint32_t *)UID_BASE)));
}

/**
  * @brief  Return the second word of the unique device identifier (UID based on 96 bits)
  * @note   The application must ensures that SYSCFG clock is enabled.
  * @retval Device identifier
  */
uint32_t HAL_GetUIDw1(void)
{
  return (READ_REG(*((uint32_t *)(UID_BASE + 4U))));
}

/**
  * @brief  Return the third word of the unique device identifier (UID based on 96 bits)
  * @note   The application must ensures that SYSCFG clock is enabled.
  * @retval Device identifier
  */
uint32_t HAL_GetUIDw2(void)
{
  return (READ_REG(*((uint32_t *)(UID_BASE + 8U))));
}

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group3 HAL Debug functions
  *  @brief    HAL Debug functions
  *
@verbatim
 ===============================================================================
                      ##### HAL Debug functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Enable/Disable Debug module during Sleep mode
      (+) Enable/Disable Debug module during Stop modes
      (+) Enable/Disable Debug module during Stanby mode

@endverbatim
  * @{
  */

/**
  * @brief  Enable the Debug Module during Sleep mode.
  * @retval None
  */
void HAL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Disable the Debug Module during Sleep mode.
  * @retval None
  */
void HAL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Enable the Debug Module during Stop mode.
  * @retval None
  */
void HAL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the Debug Module during Stop mode.
  * @retval None
  */
void HAL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Enable the Debug Module during Stanby mode.
  * @retval None
  */
void HAL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Disable the Debug Module during Stanby mode.
  * @retval None
  */
void HAL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group4 HAL SYSCFG configuration functions
  *  @brief    HAL SYSCFG configuration functions
  *
@verbatim
 ===============================================================================
                      ##### HAL SYSCFG configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Enable or disable BOOT pins pull-down.
      (+) Lock and get locks status of system items.
      (+) Set (and get) TCM size and DTCM size.
      (+) Lock (and get) write accesses.
      (+) Enable or disable wait state on extended ITCM and DTCM.
      (+) Enable or disable external RW margin input for TCM memories.
      (+) Set and get the TCM biasing level.
      (+) Enable or disable the external RW for caches memories.
      (+) Set and get the cache biasing level.
      (+) Enable or disable the Power-on reset upon SW system request.
      (+) Enable or disable that Lockup requests a warm reset to the RCC
      (+) Enable or disable that Lockup generates a NMI on the core
      (+) Clear Error capture in write posting buffer
      (+) Reserve VENCRAM for VENC or release it (any use allowed)
      (+) Enable or disable PKA, SAES, CRYP1/2 and HASH reset in case of potential tamper
      (+) Set/Get write/read Qos for NP1, NP2 or CPU.
      (+) Enable or disable SDMMC early-write response.
      (+) Enable or disable USB early-write response.
      (+) Enable or disable the NPU NIC, NPU NOC or CPU NOC clock gating.
      (+) Enable or disable the VDDIOx compensation cell.
      (+) Configure or get VDDIOx compensation cells.
      (+) Get VDDIOx compensation ready status.
      (+) Enable or disable the VDD compensation cell.
      (+) Configure or get VDD compensation cells.
      (+) Configure or get the Timer Break input for error flag
      (+) Set and get secure OS allocation of specific CID to the DMA channel
      (+) Set and get non-secure OS allocation of specific CID to the DMA channel
      (+) Enable or disable Retiming on RX path.
      (+) Enable or disable Retiming on TX path.
      (+) Set and get Delay on feedback clock.
      (+) Enable or disable the interleaving on NPU RAM.
      (+) Get BOOT pin connection status
      (+) Get the address of first error in P-AHB write-posting buffer

@endverbatim
  * @{
  */

/**
  * @brief  Enable the Pull Down on BOOT pin.
  * @param  BootId Specifies the boot pins.
  *         This parameter can one of the following values:
  *            @arg SYSCFG_BOOT_0 boot 0 pin
  *            @arg SYSCFG_BOOT_1 boot 1 pin
  * @retval None
  */
void HAL_SYSCFG_EnablePullDown(uint32_t BootId)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_BOOT_ID(BootId));

  SET_BIT(SYSCFG->BOOTCR, BootId);
}

/**
  * @brief  Disable the Pull Down on BOOT pin.
  * @param  BootId Specifies the boot pins.
  *         This parameter can one of the following values:
  *            @arg SYSCFG_BOOT_0 boot 0 pin
  *            @arg SYSCFG_BOOT_1 boot 1 pin
  * @retval None
  */
void HAL_SYSCFG_DisablePullDown(uint32_t BootId)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_BOOT_ID(BootId));

  CLEAR_BIT(SYSCFG->BOOTCR, BootId);
}

/**
  * @brief  Lock the SYSCFG item(s).
  * @note   Lock(s) cleared only at system reset
  * @param  Item Item(s) to set lock on.
  *         This parameter can be a combination of @ref SYSCFG_Lock_items
  * @retval None
  */
void HAL_SYSCFG_Lock(uint32_t Item)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_LOCK_ITEMS(Item));

  MODIFY_REG(SYSCFG->CM55CR, SYSCFG_LOCK_ALL, Item);
}

/**
  * @brief  Get the lock state of SYSCFG item.
  * @param  pItem Pointer to return locked items
  *         the return value can be a combination of @ref SYSCFG_Lock_items
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetLock(uint32_t *pItem)
{
  /* Check null pointer */
  if (pItem == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  *pItem = READ_BIT(SYSCFG->CM55CR, SYSCFG_LOCK_ALL);

  return HAL_OK;
}

/**
  * @brief  Set the DTCM and ITCM memory sizes.
  * @note   Write-once TCM configuration change.
  * @note   Effective change applied upon new power-on reset by calling
  *         HAL_SYSCFG_EnablePowerOnReset() and NVIC_SystemReset()
  * @param  DtcmSize DTCM memory size
  *         This parameter can one of the following values:
  *            @arg SYSCFG_DTCM_128K 128K
  *            @arg SYSCFG_DTCM_256K 256K
  * @param  ItcmSize ITCM memory size
  *         This parameter can one of the following values:
  *            @arg SYSCFG_ITCM_64K  64K
  *            @arg SYSCFG_ITCM_128K 128K
  *            @arg SYSCFG_ITCM_256K 256K
  * @retval None
  */
void HAL_SYSCFG_SetTCMSize(uint32_t DtcmSize, uint32_t ItcmSize)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_DTCM_SIZE(DtcmSize));
  assert_param(IS_SYSCFG_ITCM_SIZE(ItcmSize));

  MODIFY_REG(SYSCFG->CM55TCMCR, SYSCFG_CM55TCMCR_CFGDTCMSZ | SYSCFG_CM55TCMCR_CFGITCMSZ, DtcmSize | ItcmSize);
}

/**
  * @brief  Get the DTCM and ITCM memory sizes.
  * @param  pDtcmSize Pointer to return DTCM memory size
  *         This return value can be one of
  *            @arg SYSCFG_DTCM_128K 128K
  *            @arg SYSCFG_DTCM_256K 256K
  * @param  pItcmSize Pointer to return ITCM memory size
  *         This return value can be one of
  *            @arg SYSCFG_ITCM_64K  64K
  *            @arg SYSCFG_ITCM_128K 128K
  *            @arg SYSCFG_ITCM_256K 256K
  * @retval HAL status
   */
HAL_StatusTypeDef HAL_SYSCFG_GetTCMSize(uint32_t *pDtcmSize, uint32_t *pItcmSize)
{
  uint32_t values;

  /* Check null pointer */
  if ((pDtcmSize == NULL) || (pItcmSize == NULL))
  {
    return HAL_ERROR;
  }

  values = READ_REG(SYSCFG->CM55TCMCR);
  *pDtcmSize = (values & 0xF0U);
  *pItcmSize = (values & 0xFU);

  return HAL_OK;
}

/**
  * @brief  Lock the SYSCFG write access item(s).
  * @note   Lock(s) cleared only at system reset
  * @param  Item Item(s) to set lock on.
  *         This parameter can be a combination of @ref SYSCFG_WRITE_access
  * @retval None
  */
void HAL_SYSCFG_LockWriteAccess(uint32_t Item)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_LOCK_WRACCESS(Item));

  MODIFY_REG(SYSCFG->CM55TCMCR, SYSCFG_LOCK_WR_ALL, Item);
}

/**
  * @brief  Get the lock state of SYSCFG  write access item.
  * @param  pItem pointer to return locked items
  *         the return value can be a combination of @ref SYSCFG_WRITE_access
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetLockWriteAccess(uint32_t *pItem)
{
  /* Check null pointer */
  if (pItem == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  *pItem = READ_BIT(SYSCFG->CM55TCMCR, SYSCFG_LOCK_WR_ALL);

  return HAL_OK;
}

/**
  * @brief  Enable the ITCM Wait State.
  * @retval None
  */
void HAL_SYSCFG_EnableITCMWaiteState(void)
{
  SET_BIT(SYSCFG->CM55TCMCR, SYSCFG_CM55TCMCR_ITCMWSDISABLE);
}

/**
  * @brief  Disable the ITCM Wait State.
  * @retval None
  */
void HAL_SYSCFG_DisableITCMWaiteState(void)
{
  CLEAR_BIT(SYSCFG->CM55TCMCR, SYSCFG_CM55TCMCR_ITCMWSDISABLE);
}

/**
  * @brief  Enable the DTCM Wait State.
  * @retval None
  */
void HAL_SYSCFG_EnableDTCMWaiteState(void)
{
  SET_BIT(SYSCFG->CM55TCMCR, SYSCFG_CM55TCMCR_DTCMWSDISABLE);
}

/**
  * @brief  Disable the DTCM Wait State.
  * @retval None
  */
void HAL_SYSCFG_DisableDTCMWaiteState(void)
{
  CLEAR_BIT(SYSCFG->CM55TCMCR, SYSCFG_CM55TCMCR_DTCMWSDISABLE);
}

/**
  * @brief  Enable external RW margin inputs for TCM memories
  * @retval None
  */
void HAL_SYSCFG_EnableTCMExternalMargin(void)
{
  SET_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RME_TCM);
}

/**
  * @brief  Disable external RW margin inputs for TCM memories
  * @retval None
  */
void HAL_SYSCFG_DisableTCMExternalMargin(void)
{
  CLEAR_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RME_TCM);
}

/**
  * @brief  Set external RW margin inputs for TCM memories.
  * @param  TcmRwMarginInput Input Margin.
  * @retval None
  */
void HAL_SYSCFG_SetTCMRWMarginInput(uint32_t TcmRwMarginInput)
{
  assert_param(IS_TCM_MARGIN_INPUT(TcmRwMarginInput));

  MODIFY_REG(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RM_TCM, (TcmRwMarginInput << 1U));
}

/**
  * @brief  Get the External RW margin inputs for TCM memories.
  * @param  pTcmRwMarginInput pointer to return Input Margin.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_SYSCFG_GetTCMRWMarginInput(uint32_t *pTcmRwMarginInput)
{
  /* Check null pointer */
  if (pTcmRwMarginInput == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  *pTcmRwMarginInput = (READ_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RM_TCM) >> 1U);

  return HAL_OK;
}

/**
  * @brief  Set the TCM biasing level adjust input.
  * @param  Level Biaising level adjust input
  *         This parameter can one of the following values:
  *            @arg SYSCFG_TCM_BIAS_VNOM : Biasing level adjust input recommended for Vnom
  *            @arg SYSCFG_TCM_BIAS_VNOM_10_PERCENT : Biasing level adjust input recommended for Vnom + 10%
  * @retval None
  */
void HAL_SYSCFG_SetTCMBiasingLevel(uint32_t Level)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_TCM_BIASING_LEVEL(Level));

  MODIFY_REG(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_BC2_TCM | SYSCFG_CM55RWMCR_BC1_TCM, Level);
}

/**
  * @brief  Get the TCM biasing level adjust input.
  * @param  pLevel Pointer to return biasing level adjust input.
  *         The return value can be one of the following values:
  *            @arg SYSCFG_CACHE_BIAS_VNOM boot 0 pin: Biasing level adjust input recommended for Vnom
  *            @arg SYSCFG_CACHE_BIAS_VNOM_10_PERCENT: Biasing level adjust input recommended for Vnom + 10%
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetTCMBiasingLevel(uint32_t *pLevel)
{
  /* Check null pointer */
  if (pLevel == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  *pLevel = READ_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_BC2_TCM | SYSCFG_CM55RWMCR_BC1_TCM);

  return HAL_OK;
}

/**
  * @brief  Enable external RW margin inputs for Cache memories
  * @retval None
  */
void HAL_SYSCFG_EnableCacheExternalMargin(void)
{
  SET_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RME_CACHE);
}

/**
  * @brief  Disable external RW margin inputs for Cache memories
  * @retval None
  */
void HAL_SYSCFG_DisableCacheExternalMargin(void)
{
  CLEAR_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RME_CACHE);
}

/**
  * @brief  Set External RW margin inputs for Cache memories.
  * @param  CacheRWMarginInput Input Margin.
  * @retval None
  */
void HAL_SYSCFG_SetCacheRWMarginInput(uint32_t CacheRWMarginInput)
{
  assert_param(IS_TCM_MARGIN_INPUT(CacheRWMarginInput));

  MODIFY_REG(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RM_CACHE, (CacheRWMarginInput << 8U));
}

/**
  * @brief  Get the External RW margin inputs for Cache memories.
  * @param  pCacheRWMarginInput Pointer to return Input Margin.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetCacheRWMarginInput(uint32_t *pCacheRWMarginInput)
{
  /* Check null pointer */
  if (pCacheRWMarginInput == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  *pCacheRWMarginInput = (READ_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_RM_CACHE) >> 8U);

  return HAL_OK;
}

/**
  * @brief  Set the Cache biasing level adjust input.
  * @param  Level the biaising level adjust input
  *         This parameter can one of the following values:
  *            @arg SYSCFG_CACHE_BIAS_VNOM: Biasing level adjust input recommended for Vnom
  *            @arg SYSCFG_CACHE_BIAS_VNOM_10_PERCENT: Biasing level adjust input recommended for Vnom + 10%
  * @retval None
  */
void HAL_SYSCFG_SetCacheBiasingLevel(uint32_t Level)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_CACHE_BIASING_LEVEL(Level));

  MODIFY_REG(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_BC2_CACHE | SYSCFG_CM55RWMCR_BC1_CACHE, Level);
}

/**
  * @brief  Get the Cache biasing level adjust input.
  * @param  pLevel Pointer to return Cache biasing level adjust input.
  *         The return value can be onr of the following values:
  *            @arg SYSCFG_CACHE_BIAS_VNOM boot: Biasing level adjust input recommended for Vnom
  *            @arg SYSCFG_CACHE_BIAS_VNOM_10_PERCENT: Biasing level adjust input recommended for Vnom + 10%
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetCacheBiasingLevel(uint32_t *pLevel)
{
  /* Check null pointer */
  if (pLevel == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the cache biaising */
  *pLevel = READ_BIT(SYSCFG->CM55RWMCR, SYSCFG_CM55RWMCR_BC2_CACHE | SYSCFG_CM55RWMCR_BC1_CACHE);

  return HAL_OK;
}

/**
  * @brief  Set the secure vector table (VTOR) address.
  * @note   Secure vector table address must be set to ensure return from STANDBY state.
  * @param  Address Secure VTOR address
  * @retval None
  */
void HAL_SYSCFG_SetSVTORAddress(uint32_t Address)
{
  /* Check the parameters */
  assert_param(IS_VTOR_ADDRESS(Address));

  WRITE_REG(SYSCFG->INITSVTORCR, Address);
}

/**
  * @brief  Get the secure vector table (VTOR) address.
  * @param  pAddress  Pointer to return the secure vector table address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetSVTORAddress(uint32_t *pAddress)
{
  /* Check null pointer */
  if (pAddress == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the secure VTOR address */
  *pAddress = READ_REG(SYSCFG->INITSVTORCR);

  return HAL_OK;
}

/**
  * @brief  Set the non secure vector table (VTOR) address.
  * @param  Address Non-secure VTOR address
  * @retval None
  */
void HAL_SYSCFG_SetNSVTORAddress(uint32_t Address)
{
  /* Check the parameters */
  assert_param(IS_VTOR_ADDRESS(Address));

  WRITE_REG(SYSCFG->INITNSVTORCR, Address);
}

/**
  * @brief  Get the non secure VTOR address.
  * @param  pAddress  Pointer to return the non-secure vector table address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetNSVTORAddress(uint32_t *pAddress)
{
  /* Check null pointer */
  if (pAddress == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure VTOR address */
  *pAddress = READ_REG(SYSCFG->INITNSVTORCR);

  return HAL_OK;
}

/**
  * @brief  Enable the Power-on reset.
  * @note   Select power-on reset to apply on core upon SYSRESETREQ (NVIC_SystemReset())
  * @retval None
  */
void HAL_SYSCFG_EnablePowerOnReset(void)
{
  SET_BIT(SYSCFG->CM55RSTCR, SYSCFG_CM55RSTCR_CORE_RESET_TYPE);
}

/**
  * @brief  Disable the Power-on reset.
  * @note   Select warm reset to apply on core upon SYSRESETREQ (NVIC_SystemReset())
  * @retval None
  */
void HAL_SYSCFG_DisablePowerOnReset(void)
{
  CLEAR_BIT(SYSCFG->CM55RSTCR, SYSCFG_CM55RSTCR_CORE_RESET_TYPE);
}

/**
  * @brief  Enable Lockup requests a warm reset to the RCC.
  * @note   Select action to perform on a lockup state on the core
  * @retval None
  */
void HAL_SYSCFG_EnableLockupWarmResetonRCC(void)
{
  SET_BIT(SYSCFG->CM55RSTCR, SYSCFG_CM55RSTCR_LOCKUP_RST_EN);
}

/**
  * @brief  Disable Lockup requests a warm reset to the RCC.
  * @note   Select action to perform on a lockup state on the core
  * @retval None
  */
void HAL_SYSCFG_DisableLockupWarmResetonRCC(void)
{
  CLEAR_BIT(SYSCFG->CM55RSTCR, SYSCFG_CM55RSTCR_LOCKUP_RST_EN);
}

/**
  * @brief  Enable Lockup generates a NMI on the core.
  * @note   Select action to perform on a lockup state on the core
  * @retval None
  */
void HAL_SYSCFG_EnableLockupGenerateNMI(void)
{
  SET_BIT(SYSCFG->CM55RSTCR, SYSCFG_CM55RSTCR_LOCKUP_NMI_EN);
}

/**
  * @brief  Disable Lockup generates a NMI on the core.
  * @note   Select action to perform on a lockup state on the core
  * @retval None
  */
void HAL_SYSCFG_DisableLockupGenerateNMI(void)
{
  CLEAR_BIT(SYSCFG->CM55RSTCR, SYSCFG_CM55RSTCR_LOCKUP_NMI_EN);
}

/**
  * @brief   Enable the capture mechanism upon write posting buffer error.
  * @note    Upon error detection, the erroneous address is logged on and
  *          the capture mechanism is on hold.
  *          The address error can be read thanks to
  *          HAL_SYSCFG_GetAddressWritePostingBuffer.
  *  @note   This function enables the error capture mechanism again.
  *  @retval HAL status.
  */
HAL_StatusTypeDef HAL_SYSCFG_ReEnableWritePostingErrorCapture(void)
{
  /* Re-enable HW write posting detection mechanism */
  SET_BIT(SYSCFG->CM55PAHBWPR, SYSCFG_CM55PAHBWPR_PAHB_ERROR_ACK);

  CLEAR_BIT(SYSCFG->CM55PAHBWPR, SYSCFG_CM55PAHBWPR_PAHB_ERROR_ACK);

  return HAL_OK;
}

#if defined(VENC)
/**
  * @brief  Reserve the VENCRAM allocation to VENC.
  * @retval None
  */
void HAL_SYSCFG_EnableVENCRAMReserved(void)
{
  CLEAR_BIT(SYSCFG->VENCRAMCR, SYSCFG_VENCRAMCR_VENCRAM_EN);
}

/**
  * @brief  Release the VENCRAM allocation to VENC (any use allowed).
  * @retval None
  */
void HAL_SYSCFG_DisableVENCRAMReserved(void)
{
  SET_BIT(SYSCFG->VENCRAMCR, SYSCFG_VENCRAMCR_VENCRAM_EN);
}

#endif /* VENC */

/**
  * @brief  Enable PKA, SAES, CRYP1/2, and HASH reset, in case of potential tamper
  * @retval None
  */
void HAL_SYSCFG_EnableCRYPPotentialTamper(void)
{
  CLEAR_BIT(SYSCFG->POTTAMPRSTCR, SYSCFG_POTTAMPRSTCR_POTTAMPERSETMASK);
}

/**
  * @brief  Disable PKA, SAES, CRYP1/2, and HASH reset, in case of potential tamper
  * @retval None
  */
void HAL_SYSCFG_DisableCRYPPotentialTamper(void)
{
  SET_BIT(SYSCFG->POTTAMPRSTCR, SYSCFG_POTTAMPRSTCR_POTTAMPERSETMASK);
}

#if defined(SYSCFG_NPUNICQOSCR_NPU1_ARQOSR)
/**
  * @brief  Set write QoS information for master port from NP1 NPUNIC
  * @param  QosValue Write QoS value (0 to 15).
  * @retval None
  */
void HAL_SYSCFG_SetWriteQosNP1(uint32_t QosValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_QOS_CPU(QosValue));

  MODIFY_REG(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU1_ARQOSW, QosValue << 4U);
}

/**
  * @brief  Get write QoS information for master port from NP1 NPUNIC
  * @param  pQosValue Pointer to return write QOS value (0 to 15)
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_SYSCFG_GetWriteQosNP1(uint32_t *pQosValue)
{
  /* Check null pointer */
  if (pQosValue == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the QOS */
  *pQosValue = (READ_BIT(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU1_ARQOSW) >> 4U);

  return HAL_OK;
}

/**
  * @brief  Set read QoS information for master port from NP1 NPUNIC
  * @param  QosValue Read QoS value (0 to 15)
  * @retval None
  */
void HAL_SYSCFG_SetReadQosNP1(uint32_t QosValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_QOS_CPU(QosValue));

