micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal.c
  MODIFY_REG(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU1_ARQOSR, QosValue);
}

/**
  * @brief  Get read QoS information for master port from NP1 NPUNIC
  * @param  pQosValue Pointer to return read QOS value (0 to 15)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetReadQosNP1(uint32_t *pQosValue)
{
  /* Check null pointer */
  if (pQosValue == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the QOS */
  *pQosValue = READ_BIT(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU1_ARQOSR);

  return HAL_OK;
}

/**
  * @brief  Set write QoS information for master port from NP2 NPUNIC
  * @param  QosValue Write Qos value (0 to 15)
  * @retval None
  */
void HAL_SYSCFG_SetWriteQosNP2(uint32_t QosValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_QOS_CPU(QosValue));

  MODIFY_REG(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU2_ARQOSW, QosValue << 12U);
}

/**
  * @brief  Get write QoS information for master port from NP2 NPUNIC
  * @param  pQosValue Pointer to return write QOS value (0 to 15)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetWriteQosNP2(uint32_t *pQosValue)
{
  /* Check null pointer */
  if (pQosValue == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the QOS */
  *pQosValue = (READ_BIT(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU2_ARQOSW) >> 12U);

  return HAL_OK;
}

/**
  * @brief  Set read QoS information for master port from NP2 NPUNIC
  * @param  QosValue Read Qos value (0 to 15)
  * @retval None
  */
void HAL_SYSCFG_SetReadQosNP2(uint32_t QosValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_QOS_CPU(QosValue));

  MODIFY_REG(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU2_ARQOSR, QosValue << 8U);
}

/**
  * @brief  Get read QoS information for master port from NP2 NPUNIC
  * @param  pQosValue Pointer to return read QOS value (0 to 15)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetReadQosNP2(uint32_t *pQosValue)
{
  /* Check null pointer */
  if (pQosValue == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the QOS */
  *pQosValue = (READ_BIT(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_NPU2_ARQOSR) >> 8U);

  return HAL_OK;
}

/**
  * @brief  Set write QoS information for master port from CPUSS NPUNIC
  * @param  QosValue Write QoS value (0 to 15)
  * @retval None
  */
void HAL_SYSCFG_SetWriteQosCPUSS(uint32_t QosValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_QOS_CPU(QosValue));

  MODIFY_REG(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_CPUSS_ARQOSW, QosValue << 20U);
}

/**
  * @brief  Get write QoS information for master port from CPUSS NPUNIC
  * @param  pQosValue Pointer to return write QOS value (0 to 15)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetwriteQosCPUSS(uint32_t *pQosValue)
{
  /* Check null pointer */
  if (pQosValue == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the QOS */
  *pQosValue = (READ_BIT(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_CPUSS_ARQOSW) >> 20U);

  return HAL_OK;
}

/**
  * @brief  Set read QoS information for master port from CPUSS NPUNIC
  * @param  QosValue Read QoS value (0 to 15)
  * @retval None
  */
void HAL_SYSCFG_SetReadQosCPUSS(uint32_t QosValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_QOS_CPU(QosValue));

  MODIFY_REG(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_CPUSS_ARQOSR, QosValue << 16U);
}

/**
  * @brief  Get read QoS information for master port from CPUSS NPUNIC
  * @param  pQosValue Pointer to return read QOS value (0 to 15)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetReadQosCPUSS(uint32_t *pQosValue)
{
  /* Check null pointer */
  if (pQosValue == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the QOS */
  *pQosValue = (READ_BIT(SYSCFG->NPUNICQOSCR, SYSCFG_NPUNICQOSCR_CPUSS_ARQOSR) >> 16U);

  return HAL_OK;
}
#endif /* defined(SYSCFG_NPUNICQOSCR_NPU1_ARQOSR) */

/**
  * @brief  Enable SDMMC early-write response.
  * @param  Sdmmc Selected SDMMC instance(s).
  *               This parameter can be a one of @ref SYSCFG_SDMMCId
  * @retval None
  */
void HAL_SYSCFG_EnableSDMMCEarlyWRRESP(uint32_t Sdmmc)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_SDMMC(Sdmmc));

  SET_BIT(SYSCFG->ICNEWRCR, Sdmmc);
}

/**
  * @brief  Disable SDMMC early-write response.
  * @param  Sdmmc Selected SDMMC instance(s).
  *               This parameter can be a one of @ref SYSCFG_SDMMCId
  * @retval None
  */
void HAL_SYSCFG_DisableSDMMCEarlyWRRSP(uint32_t Sdmmc)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_SDMMC(Sdmmc));

  CLEAR_BIT(SYSCFG->ICNEWRCR, Sdmmc);
}

/**
  * @brief  Enable USB early-write response.
  * @param  Usb Selected USB instance(s).
  *             This parameter can be a one of @ref SYSCFG_USBId
  * @retval None
  */
void HAL_SYSCFG_EnableUSBEarlyEarlyWRRESP(uint32_t Usb)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_USB(Usb));

  SET_BIT(SYSCFG->ICNEWRCR, Usb);
}

/**
  * @brief  Disable USB early-write response.
  * @param  Usb Selected USB instance(s).
  *             This parameter can be a one of @ref SYSCFG_USBId
  * @retval None
  */
void HAL_SYSCFG_DisableUSBEarlyEarlyWRRESP(uint32_t Usb)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_USB(Usb));

  CLEAR_BIT(SYSCFG->ICNEWRCR, Usb);
}

/**
  * @brief  Enable xPU clock gating.
  * @param  Xpu Selected CPU(s).
  *             This parameter can be a one of @ref SYSCFG_XPUId
  * @retval None
  */
void HAL_SYSCFG_EnablexPUClockGating(uint32_t Xpu)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_CPU_CLK_GATING(Xpu));

  SET_BIT(SYSCFG->ICNCGCR, Xpu);
}

/**
  * @brief  Disable xPU clock gating.
  * @param  Xpu Selected CPU(s).
  *             This parameter can be a one of @ref SYSCFG_XPUId
  * @retval None
  */
void HAL_SYSCFG_DisablexPUClockGating(uint32_t Xpu)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_CPU_CLK_GATING(Xpu));

  CLEAR_BIT(SYSCFG->ICNCGCR, Xpu);
}

/**
  * @brief  Enable the VDDIO2 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_EnableVDDIO2CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_EN);
}

/**
  * @brief  Disable the VDDIO2 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_DisableVDDIO2CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_EN);
}

/**
  * @brief  Enable the VDDIO3 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_EnableVDDIO3CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_EN);
}

/**
  * @brief  Disable the VDDIO3 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_DisableVDDIO3CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_EN);
}

/**
  * @brief  Enable the VDDIO4 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_EnableVDDIO4CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_EN);
}

/**
  * @brief  Disable the VDDIO4 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_DisableVDDIO4CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_EN);
}

/**
  * @brief  Enable the VDDIO5 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_EnableVDDIO5CompensationCell(void)
{
  SET_BIT(SYSCFG->VDDIO5CCCR, SYSCFG_VDDIO5CCCR_EN);
}

/**
  * @brief  Disable the VDDIO5 compensation cell.
  * @retval None
  */
void HAL_SYSCFG_DisableVDDIO5CompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDIO5CCCR, SYSCFG_VDDIO5CCCR_EN);
}

/**
  * @brief  Configure the code selection for the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SYSCFG_IO_VDDIO2_CELL Compensation cell for the VDDIO2
  *            @arg SYSCFG_IO_VDDIO3_CELL Compensation cell for the VDDIO3
  *            @arg SYSCFG_IO_VDDIO4_CELL Compensation cell for the VDDIO4
  *            @arg SYSCFG_IO_VDDIO5_CELL Compensation cell for the VDDIO5
  * @param  Code code selection to be applied for the I/O compensation cell
  *         This parameter can be one of the following values:
  *            @arg SYSCFG_IO_CELL_CODE  Code from the cell (available in the SYSCFG_VDDIOxCCSR)
  *            @arg SYSCFG_IO_REGISTER_CODE Code from the compensation cell code register ((SYSCFG_VDDIOxCCCR)
  * @param  NmosValue In case SYSCFG_IO_REGISTER_CODE is selected, it  provides the Nmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @param  PmosValue In case SYSCFG_IO_REGISTER_CODE is selected, it  provides the Pmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_ConfigVDDIOCompensationCell(uint32_t Selection, uint32_t Code, uint32_t NmosValue,
                                                         uint32_t PmosValue)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_SYSCFG_COMPENSATION_CELL(Selection));
  assert_param(IS_SYSCFG_IO_COMPENSATION_CODE(Code));

  if (Code == SYSCFG_IO_REGISTER_CODE)
  {
    /* Check the parameters */
    assert_param(IS_SYSCFG_IO_COMPENSATION_CELL_NMOS_VALUE(NmosValue));
    assert_param(IS_SYSCFG_IO_COMPENSATION_CELL_PMOS_VALUE(PmosValue));

