micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal.c
    /* Reject forbidden Nmos = 0 and Pmos = 15 */
    if ((NmosValue == 0U) || (PmosValue == 0xFU))
    {
      status = HAL_ERROR;
    }
    else
    {
      switch (Selection)
      {
        case SYSCFG_IO_VDDIO2_CELL:
        {
          MODIFY_REG(SYSCFG->VDDIO2CCCR, 0x2FFU, ((NmosValue | (PmosValue << (4U))) | SYSCFG_VDDIO2CCCR_CS));
          break;
        }
        case SYSCFG_IO_VDDIO3_CELL:
        {
          MODIFY_REG(SYSCFG->VDDIO3CCCR, 0x2FFU, ((NmosValue | (PmosValue << (4U))) | SYSCFG_VDDIO3CCCR_CS));
          break;
        }
        case SYSCFG_IO_VDDIO4_CELL:
        {
          MODIFY_REG(SYSCFG->VDDIO4CCCR, 0x2FFU, ((NmosValue) | (PmosValue << (4U)) | SYSCFG_VDDIO4CCCR_CS));
          break;
        }
        case SYSCFG_IO_VDDIO5_CELL:
        {
          MODIFY_REG(SYSCFG->VDDIO5CCCR, 0x2FFU, ((NmosValue | (PmosValue << (4U))) | SYSCFG_VDDIO5CCCR_CS));
          break;
        }
        default:
        {
          /* Update error status */
          status = HAL_ERROR;
          break;
        }
      }
    }
  }
  else
  {
    switch (Selection)
    {

      case SYSCFG_IO_VDDIO2_CELL:
      {
        MODIFY_REG(SYSCFG->VDDIO2CCCR, SYSCFG_VDDIO2CCCR_CS, 0U);
        break;
      }
      case SYSCFG_IO_VDDIO3_CELL:
      {
        MODIFY_REG(SYSCFG->VDDIO3CCCR, SYSCFG_VDDIO3CCCR_CS, 0U);
        break;
      }
      case SYSCFG_IO_VDDIO4_CELL:
      {
        MODIFY_REG(SYSCFG->VDDIO4CCCR, SYSCFG_VDDIO4CCCR_CS, 0U);
        break;
      }
      case SYSCFG_IO_VDDIO5_CELL:
      {
        MODIFY_REG(SYSCFG->VDDIO5CCCR, SYSCFG_VDDIO5CCCR_CS, 0U);
        break;
      }
      default:
      {
        /* Update error status */
        status = HAL_ERROR;
        break;
      }
    }
  }
  return status;
}

/**
  * @brief  Get the code selection for the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SYSCFG_IO_VDDIO2_CELL Compensation cell for the VDDIO2
  *            @arg SYSCFG_IO_VDDIO3_CELL Compensation cell for the VDDIO3
  *            @arg SYSCFG_IO_VDDIO4_CELL Compensation cell for the VDDIO4
  *            @arg SYSCFG_IO_VDDIO5_CELL Compensation cell for the VDDIO5
  * @param  pCode pointer to code selection
  *         This parameter can be one of the following values:
  *            @arg SYSCFG_IO_CELL_CODE  Code from the cell (available in the SYSCFG_VDDIOxCCSR)
  *            @arg SYSCFG_IO_REGISTER_CODE Code from the compensation cell code register ((SYSCFG_VDDIOxCCCR)
  * @param  pNmosValue pointer to the Nmos value in range 0 to 15
  * @param  pPmosValue pointer to the Pmos value in range 0 to 15
  * @retval  HAL_OK (all values available) or HAL_ERROR (check parameters)
  */
HAL_StatusTypeDef HAL_SYSCFG_GetVDDIOCompensationCell(uint32_t Selection, const uint32_t *pCode, uint32_t *pNmosValue,
                                                      uint32_t *pPmosValue)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  uint32_t values = 0;

  /* Check the parameters */
  assert_param(IS_SYSCFG_COMPENSATION_CELL(Selection));
  assert_param(IS_SYSCFG_IO_COMPENSATION_CODE(*pCode));

  if ((pCode != NULL) && (pNmosValue != NULL) && (pPmosValue != NULL))
  {
    status = HAL_OK;

    if (*pCode == SYSCFG_IO_REGISTER_CODE)
    {
      switch (Selection)
      {
        case SYSCFG_IO_VDDIO2_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO2CCCR) & 0xFFU;
          break;
        }
        case SYSCFG_IO_VDDIO3_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO3CCCR) & 0xFFU;
          break;
        }
        case SYSCFG_IO_VDDIO4_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO4CCCR) & 0xFFU;
          break;
        }
        case SYSCFG_IO_VDDIO5_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO5CCCR) & 0xFFU;
          break;
        }
        default:
        {
          /* Update error status */
          status = HAL_ERROR;
          break;
        }
      }
    }
    else
    {
      switch (Selection)
      {
        case SYSCFG_IO_VDDIO2_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO2CCSR) & 0xFFU;
          break;
        }
        case SYSCFG_IO_VDDIO3_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO3CCSR) & 0xFFU;
          break;
        }
        case SYSCFG_IO_VDDIO4_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO4CCSR) & 0xFFU;
          break;
        }
        case SYSCFG_IO_VDDIO5_CELL:
        {
          values = READ_REG(SYSCFG->VDDIO5CCSR) & 0xFFU;
          break;
        }
        default:
        {
          /* Update error status */
          status = HAL_ERROR;
          break;
        }
      }
    }
    *pNmosValue = (values & 0xFU);
    *pPmosValue = ((values & 0xF0U) >> 4U);
  }
  return status;
}

/**
  * @brief  Get the compensation cell ready status of VDDIO2.
  * @retval Ready status (0 (not ready) or !=0 (ready))
  */
uint32_t HAL_SYSCFG_GetCompVDDIO2CellReadyStatus(void)
{
  return READ_BIT(SYSCFG->VDDIO2CCSR, SYSCFG_VDDIO2CCSR_READY);
}

/**
  * @brief  Get the compensation cell ready status of VDDIO3.
  * @retval Ready status (0 (not ready) or !=0 (ready))
  */
uint32_t HAL_SYSCFG_GetCompVDDIO3CellReadyStatus(void)
{
  return READ_BIT(SYSCFG->VDDIO3CCSR, SYSCFG_VDDIO3CCSR_READY);
}

/**
  * @brief Get the compensation cell ready status of VDDIO4.
  * @retval Ready status (0 (not ready) or !=0 (ready))
  */
uint32_t HAL_SYSCFG_GetCompVDDIO4CellReadyStatus(void)
{
  return READ_BIT(SYSCFG->VDDIO4CCSR, SYSCFG_VDDIO4CCSR_READY);
}

/**
  * @brief Get the compensation cell ready status of VDDIO5.
  * @retval Ready status (0 (not ready) or !=0 (ready))
  */
uint32_t HAL_SYSCFG_GetCompVDDIO5CellReadyStatus(void)
{
  return READ_BIT(SYSCFG->VDDIO5CCSR, SYSCFG_VDDIO5CCSR_READY);
}

/**
  * @brief  Configure the code selection for the compensation cell of VDD
  * @param  Code code selection to be applied for the I/O compensation cell
  *         This parameter can be one of the following values:
  *            @arg SYSCFG_IO_CELL_CODE  Code from the cell (available in the SYSCFG_VDDIOxCCSR)
  *            @arg SYSCFG_IO_REGISTER_CODE Code from the compensation cell code register ((SYSCFG_VDDIOxCCCR)
  * @param  NmosValue In case SYSCFG_IO_REGISTER_CODE is selected, it  provides the Nmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @param  PmosValue In case SYSCFG_IO_REGISTER_CODE is selected, it  provides the Pmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_SYSCFG_ConfigVDDCompensationCell(uint32_t Code, uint32_t NmosValue, uint32_t PmosValue)
{
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_SYSCFG_IO_COMPENSATION_CODE(Code));

  if (Code == SYSCFG_IO_REGISTER_CODE)
  {
    /* Check the parameters */
    assert_param(IS_SYSCFG_IO_COMPENSATION_CELL_NMOS_VALUE(NmosValue));
    assert_param(IS_SYSCFG_IO_COMPENSATION_CELL_PMOS_VALUE(PmosValue));

