micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal.c
    MODIFY_REG(SYSCFG->VDDCCCR, 0xFFU, ((NmosValue | (PmosValue << (4U))) | SYSCFG_VDDCCCR_CS));

    status = HAL_OK;
  }
  else
  {
    MODIFY_REG(SYSCFG->VDDCCCR, 0x200U, 0U);
    status = HAL_OK;
  }
  return status;
}

/**
  * @brief  Enable the VDD compensation cell.
  * @retval None
  */
void HAL_SYSCFG_EnableVDDCompensationCell(void)
{
  SET_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_EN);
}

/**
  * @brief  Disable the VDD compensation cell.
  * @retval None
  */
void HAL_SYSCFG_DisableVDDCompensationCell(void)
{
  CLEAR_BIT(SYSCFG->VDDCCCR, SYSCFG_VDDCCCR_EN);
}

/**
  * @brief  Get the code selection for the compensation cell of VDD
  * @param  Code code selection
  *         This parameter can be one of the following values:
  *            @arg SYSCFG_IO_CELL_CODE  Code from the cell (available in the SYSCFG_VDDIOxCCSR)
  *            @arg SYSCFG_IO_REGISTER_CODE Code from the compensation cell code register ((SYSCFG_VDDIOxCCCR)
  * @param  pNmosValue pointer to the Nmos value in range 0 to 15
  * @param  pPmosValue pointer to the Pmos value in range 0 to 15
  * @retval HAL_OK (all values available) or HAL_ERROR (check parameters)
  */
HAL_StatusTypeDef HAL_SYSCFG_GetVDDCompensationCell(uint32_t Code, uint32_t *pNmosValue,
                                                    uint32_t *pPmosValue)
{
  uint32_t values;
  HAL_StatusTypeDef status = HAL_ERROR;

  /* Check the parameters */
  assert_param(IS_SYSCFG_IO_COMPENSATION_CODE(Code));

  if ((pNmosValue != NULL) && (pPmosValue != NULL))
  {
    if (Code == SYSCFG_IO_REGISTER_CODE)
    {
      values = READ_REG(SYSCFG->VDDCCCR) & 0xFFU;
    }
    else
    {
      values = READ_REG(SYSCFG->VDDCCSR) & 0xFFU;
    }

    *pNmosValue = (values & 0xFU);
    *pPmosValue = ((values >> 4U) & 0xFU);

    status = HAL_OK;
  }
  return status;
}

/**
  * @brief  Get the compensation cell ready status of VDD.
  * @retval Ready status (0 (not ready) or !=0 (ready))
  */
uint32_t HAL_SYSCFG_GetCompensationVDDCellReadyStatus(void)
{
  return READ_BIT(SYSCFG->VDDCCSR, SYSCFG_VDDCCSR_READY);
}

/**
  * @brief  Configure the Timer Break input for error flag(s).
  * @note   When a configuration is set, only a system reset can reset it.
  * @param  Input Input configuration
  *              This parameter can be one or a combination of the following values:
  *                @arg SYSCFG_CBR_BREAK_LOCK_CORE       Cortex-CM55 lockup
  *                @arg SYSCFG_CBR_BREAK_LOCK_PVD        PVD lock
  *                @arg SYSCFG_CBR_BREAK_LOCK_BKPRAM     Backup SRAM ECC error
  *                @arg SYSCFG_CBR_BREAK_LOCK_CM55_CACHE CM55 cache double ECC error
  *                @arg SYSCFG_CBR_BREAK_LOCK_CM55_TCM   DTCM double ECC error
  * @retval None
  */
void HAL_SYSCFG_ConfigTimerBreakInput(uint32_t Input)
{
  /* Check the parameter */
  assert_param(IS_SYSCFG_CBR_BREAK_INPUT(Input));

  MODIFY_REG(SYSCFG->CBR, Input, Input);
}

/**
  * @brief  Get the Timer Break input configuration.
  * @note   When a configuration is set, only a system reset can reset it.
  * @retval Timer break input configuration
  *              This return value can be one or a combination of the following values:
  *                @arg SYSCFG_CBR_BREAK_LOCK_CORE       Cortex-CM55 lockup
  *                @arg SYSCFG_CBR_BREAK_LOCK_PVD        PVD lock
  *                @arg SYSCFG_CBR_BREAK_LOCK_BKPRAM     Backup SRAM ECC error
  *                @arg SYSCFG_CBR_BREAK_LOCK_CM55_CACHE CM55 cache double ECC error
  *                @arg SYSCFG_CBR_BREAK_LOCK_CM55_TCM   DTCM double ECC error
  */
uint32_t HAL_SYSCFG_GetTimerBreakInputConfig(void)
{
  return (SYSCFG->CBR & SYSCFG_CBR_BREAK_LOCK_ALL);
}

/**
  * @brief  Set the perceived CID of the peripheral.
  * @note   Set the perceived CID so that all accesses which arrive at the peripheral
  *         (here HPDMA) appear to carry that CID.
  *         See Multi-tenancy section of the reference manual for further information.
  * @param  Cid CID in range 0 to 7
  * @retval None
  */
void HAL_SYSCFG_SetPerceivedCID(uint32_t Cid)
{
  /* Check the parameter */
  assert_param(IS_SYSCFG_DMA_CID_SEC(Cid));

  MODIFY_REG(SYSCFG->SEC_AIDCR, SYSCFG_SEC_AIDCR_DMACID_SEC, Cid);
}

/**
  * @brief  Get the perceived CID of the peripheral.
  * @retval CID in range 0 to 7
  */
uint32_t HAL_SYSCFG_GetPerceivedCID(void)
{
  return (SYSCFG->SEC_AIDCR & SYSCFG_SEC_AIDCR_DMACID_SEC);
}

/**
  * @brief  Set the perceived CID of the peripheral as privileged.
  * @note   Set the perceived CID so that all accesses which arrive at the peripheral
  *         (here HPDMA) appear to carry that CID.
  *         This function shall be called in case of DMA channel interrupt (privileged) code
  *         to read the registers and clear the interrupt of this DMA channel.
  *         See Multi-tenancy section of the reference manual for forther information.
  * @param  Cid in range 0 to 7
  * @retval None
  */
void HAL_SYSCFG_SetPerceivedPrivCID(uint32_t Cid)
{
  MODIFY_REG(SYSCFG->SECPRIV_AIDCR, SYSCFG_SECPRIV_AIDCR_DMACID_NONSEC, Cid);
}

/**
  * @brief   Get the perceived CID of the peripheral as privileged.
  * @retval  CID in range 0 to 7
  */
uint32_t HAL_SYSCFG_GetPerceivedPrivCID(void)
{
  return (SYSCFG->SECPRIV_AIDCR & SYSCFG_SECPRIV_AIDCR_DMACID_NONSEC);
}

/**
  * @brief  Enable Retiming on RX path.
  * @retval None
  */
void HAL_SYSCFG_EnableReTimingRXpath(void)
{
  SET_BIT(SYSCFG->FMC_RETIMECR, SYSCFG_FMC_RETIMECR_CFG_RETIME_RX);
}

/**
  * @brief  Disable Retiming on RX path.
  * @retval None
  */
void HAL_SYSCFG_DisableReTimingRXpath(void)
{
  CLEAR_BIT(SYSCFG->FMC_RETIMECR, SYSCFG_FMC_RETIMECR_CFG_RETIME_RX);
}

/**
  * @brief  Enable Retiming on TX path.
  * @retval None
  */
void HAL_SYSCFG_EnableReTimingTXpath(void)
{
  SET_BIT(SYSCFG->FMC_RETIMECR, SYSCFG_FMC_RETIMECR_CFG_RETIME_TX);
}

/**
  * @brief  Disable Retiming on TX path.
  * @retval None
  */
void HAL_SYSCFG_DisableReTimingTXpath(void)
{
  CLEAR_BIT(SYSCFG->FMC_RETIMECR, SYSCFG_FMC_RETIMECR_CFG_RETIME_TX);
}

/**
  * @brief  Set delay on feedback clock.
  * @param  Delay Delay on feedback clock
  *                @arg SYSCFG_DELAY_FEEDBACK_NONE             None
  *                @arg SYSCFG_DELAY_FEEDBACK_HALF_CYCLE       Half a cycle delay
  * @retval None
  */
void HAL_SYSCFG_SetDelayOnFeedbackClock(uint32_t Delay)
{
  /* Check the parameter */
  assert_param(IS_SYSCFG_DMA_DELAY_FEEDBACK_CLOCK(Delay));

  MODIFY_REG(SYSCFG->FMC_RETIMECR, SYSCFG_FMC_RETIMECR_SDFBCLK_180, Delay);
}

/**
  * @brief  Get delay on feedback clock.
  * @retval Delay on feedback clock
  *                @arg SYSCFG_DELAY_FEEDBACK_NONE             None
  *                @arg SYSCFG_DELAY_FEEDBACK_HALF_CYCLE       Half a cycle delay
  */
uint32_t HAL_SYSCFG_GetDelayOnFeedbackClock(void)
{
  return (SYSCFG->FMC_RETIMECR & SYSCFG_FMC_RETIMECR_SDFBCLK_180);
}

#if defined(SYSCFG_NPUNICQOSCR_NPU1_ARQOSR)
/**
  * @brief  Enable the interleaving on NPU RAM.
  * @retval None
  */
void HAL_SYSCFG_EnableInterleavingCpuRam(void)
{
  SET_BIT(SYSCFG->NPU_ICNCR, SYSCFG_NPU_ICNCR_INTERLEAVING_ACTIVE);
}

/**
  * @brief  Disable the interleaving on NPU RAM.
  * @retval None
  */
void HAL_SYSCFG_DisableInterleavingCpuRam(void)
{
  CLEAR_BIT(SYSCFG->NPU_ICNCR, SYSCFG_NPU_ICNCR_INTERLEAVING_ACTIVE);
}
#endif /* SYSCFG_NPUNICQOSCR_NPU1_ARQOSR */

/**
  * @brief  Get BOOT pin connection status
  * @param  BootId specifies the boot pins.
  * @retval BOOT pin connection configuration
  *              This return value can be one of the following values:
  *                @arg SYSCFG_BOOT_CONNECTION_VSS       pin connected to VSS
  *                @arg SYSCFG_BOOT_CONNECTION_VDD       pin connected to VDD
  */
uint32_t HAL_SYSCFG_GetBootPinConnection(uint32_t BootId)
{
  uint32_t Connection;

  /* Check the parameters */
  assert_param(IS_SYSCFG_BOOT_ID(BootId));

  Connection = READ_BIT(SYSCFG->BOOTSR, BootId);

  if (BootId == SYSCFG_BOOTCR_BOOT0_PD)
  {
    return Connection;
  }
  else
  {
    return (Connection >> 1U);
  }
}

/**
  * @brief  Get address of first error in P-AHB write-posting buffer
  * @retval Address of the first error in P-AHB write-posting buffer
  */
uint32_t HAL_SYSCFG_GetAddressWritePostingBuffer(void)
{
  return READ_BIT(SYSCFG->AHBWP_ERROR_SR, SYSCFG_AHBWP_ERROR_SR_PAHB_ERROR_ADDR);
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
